fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокДоговоров</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда
		ПоказатьПредупреждение(, "Выберите период (месяц)!");
		Возврат;
	КонецЕсли;
	
	ВКМ_ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_Создать(Команда)
	
Если Объект.ВКМ_СписокДоговоров.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Список договоров пуст.");
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ПодготовитьДанныеДляФона();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ТекстОжидания", "Создание документов...");
	ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Истина);
	ДлительныеОперацииКлиент.ВыполнитьВФоне(
		"Обработка.ВКМ_МассовоеСозданиеАктов.МодульМенеджера.ВыполнитьСозданиеАктов", 
		ПараметрыВыполнения, 
		ПараметрыОжидания, 
		Новый ОписаниеОповещения("ВКМ_СоздатьЗавершение", ЭтотОбъект));
	
КонецПроцедуры


&НаКлиенте
Процедура ВКМ_СоздатьЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОтветСервера = ПолучитьРезультатИзХранилища(Результат.АдресРезультата);
		
		ТекстСообщения = "Обработка завершена." + Символы.ПС + 
						 "Создано документов: " + ОтветСервера.СозданоДокументов;
		
		Если ОтветСервера.Ошибки.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Были ошибки (см. журнал регистрации).";
		КонецЕсли;
		
		ПоказатьПредупреждение(, ТекстСообщения);
		
		ВКМ_ЗаполнитьНаСервере();
		
	Иначе
		ПоказатьПредупреждение(, "Ошибка фонового задания: " + Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьДанныеДляФона()
	
ДанныеДляОбработки = Новый Массив;
	
	Для Каждого Строка ИЗ Объект.ВКМ_СписокДоговоров Цикл
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Договор", Строка.ВКМ_Договор);
		СтруктураСтроки.Вставить("Реализация", Строка.ВКМ_Реализация);
		
		ДанныеДляОбработки.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	ПараметрыЗапуска = Новый Структура; 
	ПараметрыЗапуска.Вставить("Период", Объект.ВКМ_Период);
	ПараметрыЗапуска.Вставить("ДанныеДляОбработки", ДанныеДляОбработки);
	
	Возврат ПараметрыЗапуска;
	
КонецФункции

&НаСервере
Функция ПолучитьРезультатИзХранилища(Адрес)
	Возврат ПолучитьИзВременногоХранилища(Адрес);
КонецФункции

&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()
	
	Объект.ВКМ_СписокДоговоров.Очистить();
	
	НачалоМесяца = НачалоМесяца(Объект.ВКМ_Период);
	КонецМесяца  = КонецМесяца(Объект.ВКМ_Период);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО Договоры.Ссылка = Реализации.Договор
		|		И Реализации.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|		И НЕ Реализации.ПометкаУдаления
		|ГДЕ
		|	Договоры.ВидДоговора = &ВидДоговора
		|	И НЕ Договоры.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ВКМ_СписокДоговоров.Добавить();
		НоваяСтрока.ВКМ_Договор = Выборка.Договор;
		НоваяСтрока.ВКМ_Реализация = Выборка.Реализация;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
